In [1]:
import numpy as np
import pandas as pd

import matplotlib
import matplotlib.pyplot as plt
import seaborn as sns

# Makes graphs are embedded in Jupyter notebook instead of displaying as pop-ups
%matplotlib inline

What is the % of primary school teachers who have been in service from 5-9 yrs in the year 1998?

In [24]:
q1_df = pd.read_csv("C:/Users/Janice/Desktop/Coding/Code/Python/Notes/Practice/Tableau-SP-2021/dvt-test/Q1.csv")

sorted_q1_df = q1_df[(q1_df.year == 1998) & (q1_df.length_of_service == "5 - 9 YEARS") & (q1_df.level_of_school == "PRIMARY")]

display(sorted_q1_df)
print(q1_df[(q1_df.level_of_school == "PRIMARY") & (q1_df.year == 1998)].no_of_teachers.sum())
print(sorted_q1_df.no_of_teachers.sum()/ 20376 * 100)

     year sex level_of_school length_of_service  no_of_teachers
468  1998  MF         PRIMARY       5 - 9 YEARS            1510
469  1998   F         PRIMARY       5 - 9 YEARS            1361

20376
14.090106007067138

What is the average resale prices for 5-rm flats in the year 2013?

In [82]:
q2_df = pd.read_csv("C:/Users/Janice/Desktop/Coding/Code/Python/Notes/Practice/Tableau-SP-2021/dvt-test/Q2.csv")

q2_df["date"] = pd.to_datetime(q2_df.quarter)
q2_df["year"] = pd.DatetimeIndex(q2_df.date).year

filter_q2_df = q2_df[(q2_df.flat_type=="5-room") & (q2_df.year==2013)]
cleaned_q2_df = filter_q2_df[pd.to_numeric(q2_df['price'], errors='coerce').notnull()].reset_index(drop=True)
print(cleaned_q2_df.price.astype("float").mean())

<ipython-input-82-cdb6d68be4a2>:7: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  cleaned_q2_df = filter_q2_df[pd.to_numeric(q2_df['price'], errors='coerce').notnull()].reset_index(drop=True)

570035.9375

What is the total number of 3-room flat resale transactions in the Bukit Merah town in Q1 to Q3 of 2017?

In [93]:
q3_df = pd.read_csv("C:/Users/Janice/Desktop/Coding/Code/Python/Notes/Practice/Tableau-SP-2021/dvt-test/Q3.csv")

q3_df["date"] = pd.to_datetime(q3_df.month)
q3_df["year"] = pd.DatetimeIndex(q3_df.date).year
q3_df["month"] = pd.DatetimeIndex(q3_df.date).month

q3_df[(q3_df.flat_type == '3 ROOM') & (q3_df.town == "BUKIT MERAH") & (q3_df.year == 2017) & (q3_df.month >=1) & (q3_df.month <=9)].count()

month                  177
town                   177
flat_type              177
block                  177
street_name            177
storey_range           177
floor_area_sqm         177
flat_model             177
lease_commence_date    177
resale_price           177
date                   177
year                   177
dtype: int64

In which year was the number of rental cars population 27988?

In [129]:
q4_df = pd.read_csv("C:/Users/Janice/Desktop/Coding/Code/Python/Notes/Practice/Tableau-SP-2021/dvt-test/Q4.csv")

display(q4_df[(q4_df.vehicle_type == "Rental Cars") & (q4_df.number == 27988)])

       month vehicle_type  number
277  2015-11  Rental Cars   27988

In which years was the average number of rainy days less or equal to 12?

In [136]:
q5_df = pd.read_csv("C:/Users/Janice/Desktop/Coding/Code/Python/Notes/Practice/Tableau-SP-2021/dvt-test/Q5.csv")

q5_df["date"] = pd.to_datetime(q5_df.month)
q5_df["year"] = pd.DatetimeIndex(q5_df.date).year

grouped_q5_df = q5_df.groupby("year").mean()
grouped_q5_df[(grouped_q5_df.no_of_rainy_days <= 12)]

      no_of_rainy_days
year
1982         10.833333
1990         11.833333
1997          9.666667
2002         11.583333
2015         10.416667

What are the TOP 3 States with the most sales, ranked in descending order (highest first)?

In [143]:
xlsx = pd.ExcelFile('C:/Users/Janice/Desktop/Coding/Code/Python/Notes/Practice/Tableau-SP-2021/dvt-test/Q6Q7.xlsx')
orders_df = pd.read_excel(xlsx, "Orders")
returns_df = pd.read_excel(xlsx, "Returns")
People_df = pd.read_excel(xlsx, "People")

In [165]:
print(orders_df.columns)
display(orders_df[["State", "Sales"]].groupby("State").sum().sort_values(by="Sales", ascending=False).head(3))

Index(['Row ID', 'Order ID', 'Order Date', 'Ship Date', 'Ship Mode',
       'Customer ID', 'Customer Name', 'Segment', 'Country', 'City', 'State',
       'Postal Code', 'Region', 'Product ID', 'Category', 'Sub-Category',
       'Product Name', 'Sales', 'Quantity', 'Discount', 'Profit'],
      dtype='object')

                  Sales
State
California  457687.6315
New York    310876.2710
Texas       170188.0458

(cont'd) How many customers had at least $10,000 in sales?

In [169]:
customer_sales_df = orders_df[["Customer ID", "Sales"]].groupby("Customer ID").sum()
customer_sales_df[customer_sales_df["Sales"] >= 10000].count()

Sales    20
dtype: int64

Find the customer with the highest profit. What is his/her average shipping cost per order?

In [171]:
xlsx = pd.ExcelFile('C:/Users/Janice/Desktop/Coding/Code/Python/Notes/Practice/Tableau-SP-2021/dvt-test/Q8Q9Q10.xlsx')
orders_df = pd.read_excel(xlsx, "Orders")
returns_df = pd.read_excel(xlsx, "Returns")
People_df = pd.read_excel(xlsx, "Users")

In [182]:
# print(orders_df.columns)

display(orders_df[["Customer ID", "Profit"]].groupby("Customer ID").sum().sort_values(by="Profit", ascending=False).head(1))

print(orders_df[(orders_df["Customer ID"] == 3397)]["Shipping Cost"].mean())

Index(['Row ID', 'Order Priority', 'Discount', 'Unit Price', 'Shipping Cost',
       'Customer ID', 'Customer Name', 'Ship Mode', 'Customer Segment',
       'Product Category', 'Product Sub-Category', 'Product Container',
       'Product Name', 'Product Base Margin', 'Region', 'State or Province',
       'City', 'Postal Code', 'Order Date', 'Ship Date', 'Profit',
       'Quantity ordered new', 'Sales', 'Order ID'],
      dtype='object')

                   Profit
Customer ID
3397         17536.851156

10.493333333333334

(cont'd) For items shipped in July of 2012, what was the % of sales sent in a Large Box?

In [192]:
orders_df["date"] = pd.to_datetime(orders_df["Ship Date"])
orders_df["year"] = pd.DatetimeIndex(orders_df.date).year
orders_df["month"] = pd.DatetimeIndex(orders_df.date).month

orders_df[(orders_df["Product Container"] == "Large Box") & (orders_df.year == 2012) & (orders_df.month == 7)].count() / orders_df[(orders_df.year == 2012) & (orders_df.month == 7)].count() * 100

Row ID                  4.102564
Order Priority          4.102564
Discount                4.102564
Unit Price              4.102564
Shipping Cost           4.102564
Customer ID             4.102564
Customer Name           4.102564
Ship Mode               4.102564
Customer Segment        4.102564
Product Category        4.102564
Product Sub-Category    4.102564
Product Container       4.102564
Product Name            4.102564
Product Base Margin     3.108808
Region                  4.102564
State or Province       4.102564
City                    4.102564
Postal Code             4.102564
Order Date              4.102564
Ship Date               4.102564
Profit                  4.102564
Quantity ordered new    4.102564
Sales                   4.102564
Order ID                4.102564
date                    4.102564
year                    4.102564
month                   4.102564
dtype: float64

What is the top product subcategory by Sales within the Regular Air Ship mode method?

In [198]:
orders_df[["Product Sub-Category", "Sales"]][(orders_df["Ship Mode"] == "Regular Air")].groupby("Product Sub-Category").sum().sort_values(by="Sales", ascending=False)

                                    Sales
Product Sub-Category
Telephones and Communication    970177.62
Binders and Binder Accessories  579754.21
Copiers and Fax                 506551.24
Storage & Organization          460771.03
Computer Peripherals            436133.41
Office Furnishings              378729.32
Office Machines                 294671.53
Appliances                      266814.07
Paper                           214587.83
Envelopes                       120692.73
Chairs & Chairmats              119347.54
Pens & Art Supplies              84261.64
Tables                           45865.60
Scissors, Rulers and Trimmers    36991.97
Labels                           20149.72
Rubber Bands                      7899.98
Bookcases                          259.52